import React from "react";
import "./faq.css";

const Faq = () => {
  return (
    <div className="container">
      <div className="whatIsVPN">
        <p className="bangQue">VPN কি ? (What Is VPN In Bangla) :</p>
        <p className="bangAns">
          যখনি আমাদের ইন্টারনেট স্পিড কোমে যায় বা ফ্রি ইন্টারনেট ব্যবহার করার
          ভাব আসে, তখন আমাদের ভিপিএন (vpn) এর কথা মনে পরে। এবং, বেশিরভাগ
          লোকেরাই, vpn কে ফ্রীতে ইন্টারনেট ব্যবহারের একটি মাধ্যম হিসেবে জানেন।
          কিন্তু, সেটা সত্যি নয়। একটি VPN এর সম্পূর্ণ নাম হলো “virtual private
          network” এবং এর মানে সম্পূর্ণ আলাদা।
        </p>
        <p className="bangAns">
          সাধারণ ভাবে, যারা vpn মানে কি সেটা জানেন, তারা এর ব্যবহার কিছু blocked
          website এ প্রবেশ করার জন্য করেন। মানে, ইন্টারনেটে এমন অনেক ওয়েবসাইট
          রয়েছে, যেগুলি কিছু বিশেষ দেশ বা জায়গাতে বন্ধ বা ব্লক করা। <br />
          এবং, এই blocked website গুলিতে লোকেরা এই VPN এর মাধ্যমে প্রবেশ করে
          সেগুলি ব্যবহার করতে পারেন।
          <br />
          তাছাড়া, আজকের ইন্টারনেট (internet) এবং অনলাইনের দুনিয়াতে ইন্টারনেট
          ব্যবহারকারীদের সংখ্যা যেভাবে দিনের পর দিন বাড়ছে, ঠিক সেভাবে,
          ইন্টারনেটের মাধ্যমে আপনার personal data বা privacy details চুরি করার
          মতো সাংঘাতিক হ্যাকার (hackers) দেড় সংখ্যা ও বেড়ে যাচ্ছে।
          <br />
          এক্ষেত্রে, নিজের online privacy এবং data সম্পূর্ণ ভাবে সুরক্ষিত রাখার
          জন্যও VPN এর ব্যবহার প্রচুর পরিমানে করা হয়।
          <br />
          আসলে, VPN এর ব্যবহারের ফলে, আপনি যেই জায়গার থেকে ইন্টারনেট ব্যবহার
          করছেন, সেই জায়গাটা লুকিয়ে দেয়া হয়। এবং, তার বদলে অন্য একটি দেশ বা
          location এর নেটওয়ার্ক দেখিয়ে দেয়া হয়।
          <br />
          এতে, online hacker রা আপনার network এর আসল লোকেশন (location) খুঁজে না
          পাওয়ার ফলে, আপনার নেটওয়ার্ক (network) হ্যাক করতে পারেনা।
          <br />
          তাই, মনে রাখবেন, আজকের এই ইন্টারনেটের দুনিয়াতে সুরক্ষিত থাকার জন্য
          ভিপিএন এর ব্যবহার করাটা অনেক জরুরি।
          <br />
        </p>
        <p className="bangQue">VPN কি ? (what is vpn in bangla)</p>
        <p className="bangAns">
          একটি VPN বা Virtual private network হলো এমন একটি সুরক্ষিত কানেক্শন
          (encrypted connection) এর মাধ্যম যেটাকে ব্যবহার কোরে আমরা ইন্টারনেটের
          মাধ্যমে যেকোনো ডিভাইস (device) সুরক্ষিত ভাবে নেটওয়ার্কের সাথে সংযোগ
          করতে পারি।
          <br />
          VPN বা virtual private network আপনার ব্যবহার করা ইন্টারনেট কানেক্শনে
          অধিক security এবং privacy যোগ কোরে, যেকোনো public network, private
          network, open wifi hotspot connection কে সুরক্ষিত করে দেয়।
          <br />
          এতে, অনলাইন হ্যাকার (hacker) এবং data sealers (ডাটা চোর) দেড় থেকে
          নিজেকে এবং নিজের device ও network কে বাঁচিয়ে রাখতে পাড়া যায়।
          <br />
          আজ, VPN এর ব্যবহার দিনের পর দিন বেড়ে যাচ্ছে। কারণ, আজ ইন্টারনেটের যুগ,
          এবং আমরা ইন্টারনেটে অনলাইন পেমেন্ট, online transaction করা, personal
          information শেয়ার করা এবং আরো অনেক ধরণের কাজ করি যার ফলে অনেক সহজেই
          একজন হ্যাকার বা ডাটা চোর সেগুলি চুরি করে নিতে পারে।
          <br />
          VPN এর মাধ্যমে, ইন্টারনেট ব্যবহার করা আপনার কম্পিউটারের বা মোবাইলের IP
          Address টি বদলিয়ে দেয়া হয় এবং একটি আলাদা জায়গা বা দেশের IP address এ
          বদলে দেয়া হয়। ফলে, আপনি কোন জায়গার থেকে ইন্টারনেট ব্যবহার করছেন, সেটা
          খুঁজে পাওয়াটা অসম্ভব হয়ে দাঁড়ায়।
          <br />
          Paid বা premium “virtual private network” সার্ভিস ব্যবহার করে আপনারা
          নিজের হিসেবে যেকোনো দেশ বা শহর বেঁচে নিতে পারবেন।
          <br />
          উদাহরণ স্বরূপে, যদি আমি আমার virtual private network সেটিংস এ, New
          York সিলেক্ট করি, তাহলে যদিও আমি India থেকে ইন্টারনেট ব্যবহার করছি,
          আমার বর্তমান location “New York” হিসেবে লোকেরা দেখতে পাবেন।
          <br />
          তাহলে, “VPN কি” বা “ভিপিএন এর কাজ” কি সেটা বুঝলেন তো ? চলুন এখন vpn এর
          কিছু লাভ ও সুবিধের বেপারে জেনেনেই।
        </p>
        <p className="bangQue">
          VPN এর লাভ ও সুবিধে কি কি ? (Benefits of using a VPN)
        </p>
        <p className="bangAns">
          একটি ভিপিএন কেন ব্যবহার করবেন বা ভিপিএন ব্যবহার করে আপনার কি কি লাভ
          হবে, সেটা নিচে আমি আপনাদের এক এক করে বলে দিচ্ছি।
          <ul>
            <li>
              যখন আমরা একটি VPN service এর মাধ্যমে ইন্টারনেট ব্যবহার করি, তখন
              আপনার সকল পার্সোনাল ডাটা (personal data) সুরক্ষিত রাখা হয়। এর ফলে,
              বিভিন্ন data বা information, হ্যাকার দেড় চোখ থেকে দূরে থাকে।
            </li>
            <li>
              VPN ব্যবহার কোরে, আমরা আমাদের অনলাইন পরিচয় লুকিয়ে রাখতে পারি।
              মানে, আপনি কোন জায়গা বা দেশ থেকে ইন্টারনেট ব্যবহার করছেন, সেটা
              লুকানো সম্ভব। কিন্তু, যেই কোম্পানির ভিপিএন সার্ভিস ব্যবহার করছেন,
              তারা কিন্তু আপনার আসল IP address ও লোকেশন অবশই জানবেন।
            </li>
            <li>
              VPN ব্যবহার করে আমরা যেকোনো blocked website বা app নিজের মোবাইল ও
              কম্পিউটারে ব্যবহার করতে পারি। বেশিরভাগ লোকেরা, একটি ফ্রি ভিপিএন
              ব্যবহার কোরে বিভিন্ন blocked websites গুলিতে প্রবেশ করেন।
            </li>
            <li>
              আপনারা নিজের network এর IP address অনেক সহজেই বদলে, অন্য একটি
              country র IP address এ রূপান্তর করতে পারবেন।
            </li>
            <li>
              কিছু কিছু প্রিমিয়াম ভিপিএন (premium vpn) আপনার ইন্টারনেটের স্পিড
              বাড়িয়ে দিতে পারে। কিন্তু, আবার কিছু ফ্রি ভিপিএন আপনার ইন্টারনেট
              স্পিড কমিয়েও দিতে পারে।
            </li>
          </ul>
          তাহলে, যদি বলা হয়, “vpn এর লাভ কি কি“, তাহলে এগুলি কিছু সেরা লাভ রয়েছে
          ভিপিএন এর। তবে, আপনি যদি কিছু খারাপ উদ্দেশ্যে vpn ব্যবহার করার কথা
          ভাবছেন, তবে এই ভুল কখনোই করবেননা।
          <br />
          কারণ, police বা আইনের অধিকারীরা vpn company থেকে আপনার আসল IP address
          অনেক সহজেই বেড় করে নিতে পারবেন।
          <br />
          তাই, কেবল নিজের ইন্টারনেট কানেক্শনকে হ্যাকার (hacker) এবং ডাটা ও
          প্রাইভেসী চোর দেড় থেকে বাঁচিয়ে রাখার জন্য vpn অবশই ব্যবহার করুন।
        </p>
        <p className="bangQue">VPN এর ব্যবহার কি জরুরি ? কেন ব্যবহার করবো ?</p>
        <p className="bangAns">
          যদি আপনি আপনার ঘরে যেকোনো secure এবং private নেটওয়ার্ক ব্যবহার করে
          ইন্টারনেট ব্যবহার করছেন, তাহলে vpn এর কোনো প্রয়োজন নেই।
          <br />
          মানে, যদি আপনি একটি password protected wifi hotspot থেকে ইন্টারনেট
          ব্যবহার করছেন, তাহলে, সেটা secure এবং তখন ভিপিএন এর কোনো প্রয়োজন নেই।{" "}
          <br />
          তাছাড়া, যদি আপনারা কোনো open এবং public wifi hotspot ব্যবহার করছেন
          যেমন, railway station, কোনো hotel এ বা flight বা train এ, তখন সেই open
          নেটওয়ার্ক ব্যবহার করে যেকোনো hacker আপনার network বা system হ্যাক
          করতেই পারে। <br />
          তাই, মনে রাখবেন যে যেকোনো public এবং open নেটওয়ার্ক যেটা অচেনা অনেক
          ব্যক্তি একসাথেই ব্যবহার করছেন, সেই নেটওয়ার্ক কখনোই সুরক্ষিত না এবং তখন
          আপনার একটি VPN ব্যবহার করা উচিত। <br />
          এমনিতে, পারলে সবসময় একটি vpn ব্যবহার করে ইন্টারনেটে কানেক্ট হওয়াটা
          নিরাপদ (safe).
          <br />
          তাহলে, Vpn কেন এবং কখন ব্যবহার করবেন, সেটা হয়তো আপনারা বুঝে গেছেন।
        </p>
        <p className="bangQue">
          ভিপিএন কিভাবে ব্যবহার করবেন ? কম্পিউটার ও মোবাইলে{" "}
        </p>
        <p className="bangAns">
          ভিপিএন, যেকোনো কম্পিউটারে ও মোবাইলে ব্যবহার করাটা অনেক সহজ। আপনারা,
          যেভাবে বিভিন্ন apps বা software নিজের মোবাইল ও কম্পিউটারে ডাউনলোড এবং
          ইনস্টল কোরে ব্যবহার করেন, ঠিক সেভাবেই vpn app বা software ডাউনলোড করতে
          হবে।
          <br />
          VPN app বা vpn software ইনস্টল করার পর আপনি তার সার্ভিস enable বা on
          করতে হবে। এর পর, আপনার internet connection নিজে নিজে vpn এর সুরক্ষিত
          নেটওয়ার্কের দ্বারা কানেক্ট হয়ে যাবে।
        </p>
      </div>
    </div>
  );
};

export default Faq;
